import { Metadata } from 'next';

export const metadata: Metadata = {
  title: 'בניית חנות אינטרנטית | הקמת אתרי איקומרס לעסקים | עדי פון פתרונות דיגיטל',
  description: 'מחפשים לבנות חנות אינטרנטית מקצועית? אנו מקימים אתרי איקומרס (eCommerce) מעוצבים, מהירים ומותאמים למובייל שיזניקו לכם את המכירות. לקבלת הצעת מחיר, לחצו כאן!',
  openGraph: {
    title: 'בניית חנות אינטרנטית | הקמת אתרי איקומרס לעסקים | עדי פון פתרונות דיגיטל',
    description: 'מחפשים לבנות חנות אינטרנטית מקצועית? אנו מקימים אתרי איקומרס (eCommerce) מעוצבים, מהירים ומותאמים למובייל שיזניקו לכם את המכירות. לקבלת הצעת מחיר, לחצו כאן!',
    type: 'website',
    locale: 'he_IL',
    siteName: 'עדי פון פתרונות דיגיטל',
  },
  twitter: {
    card: 'summary_large_image',
    title: 'בניית חנות אינטרנטית | הקמת אתרי איקומרס לעסקים | עדי פון פתרונות דיגיטל',
    description: 'מחפשים לבנות חנות אינטרנטית מקצועית? אנו מקימים אתרי איקומרס (eCommerce) מעוצבים, מהירים ומותאמים למובייל שיזניקו לכם את המכירות. לקבלת הצעת מחיר, לחצו כאן!',
  },
}; 